/*-------------------------------------------------------------------------
    c_const.hpp
-------------------------------------------------------------------------*/
#ifndef _C_CONST_HPP_
#define _C_CONST_HPP_

const double PI = 3.14159265358979323846;
const double RD = 180.0/PI;
const double DR = PI/180.0;

/* Параметры эллипсоида Земли. Совпадают с WGS84. */
const double Ea = 6378.137;             /* Большая полуось земного эллипсоида. */
const double Eb = 6356.7523142;         /* Малая полуось земного эллипсоида. */
const double Ee = 8.1819190842622e-2;   /* Эксцентриситет. */
const double Ee2 = 6.69437999014e-3;    /* Квадрат эксцентриситета. */

#endif

