/*-----------------------------------------------------------------------------
    blk0.hpp
-----------------------------------------------------------------------------*/
#ifndef _BLK0_HPP_
#define _BLK0_HPP_

#include <y_util.hpp>


#pragma pack(1)

/*-----------------------------------------------------------------------------
    TBlk0_Common
    Структура, описывающая новый формат 0-блока файлов данных.
    Непосредственно в ней определена только фиксированная часть паспорта,
    общая для файлов любого типа. Для работы с полями, специфическими
    для различных типов файлов, ниже определены соответствующие структуры.
-----------------------------------------------------------------------------*/
struct TBlk0_Common {
    uchar   formatType;     /* 0    Всегда равно 0xFF. */
    char    satName[13];	/* 1    ASCIIZ-строка - имя спутника. */
    ulong   satId; 		    /* 14   Идентификатор спутника NORAD. */
    ulong   revNum;         /* 18   Номер витка. */
    ushort  year;          	/* 22   Год. */
    ushort  day;           	/* 24   День в году. */
    ulong   dayTime;       	/* 26   Время дня (мсек). */
    uchar   reserved1[32];  /* 30   Зарезервировано. */

    uchar   dataType1;      /* 62   Тип данных, часть 1 */
    uchar   dataType2;      /* 63   Тип данных, часть 2 */
};


/*-----------------------------------------------------------------------------
    TBlk0
    Структура-placeholder для 0-блока.
-----------------------------------------------------------------------------*/
struct TBlk0 {
    TBlk0_Common b0;

    uchar specific[512-64];
};


#pragma pack()


#endif